group_1c/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Платформа</name>
    <type>
      <types>EnumRef.Платформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Файловая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

group_1c/src/Catalogs/ИнформационныеБазы/ManagerModule.bsl
// Функция - Получить данные для COMСоединения
//
// Параметры:
//  ИнформационнаяБаза	 - СправочникСсылка.ИнформационнаяБаза - информационная база, к которой производится подключение
// 
// Возвращаемое значение:
//  Структура - структура данных, необходимых для подключения к информационной базе
//
Функция ПолучитьДанныеДляCOMСоединения(ИнформационнаяБаза) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Файловая");
	Структура.Вставить("ИмяСервера");
	Структура.Вставить("Порт");
	Структура.Вставить("ИмяБазы");
	Структура.Вставить("ВерсияПлатформы"	, ИнформационнаяБаза.Платформа);
	Структура.Вставить("Пользователь"		, Константы.ЛогинАдминистратор.Получить());
	Структура.Вставить("Пароль"				, Константы.ПарольАдминистратор.Получить());

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИнформационныеБазы.Файловая,
		|	ИнформационныеБазы.Сервер.Имя КАК ИмяСервера,
		|	ИнформационныеБазы.Сервер.Порт КАК Порт,
		|	ИнформационныеБазы.Имя КАК ИмяБазы,
		|	ИнформационныеБазы.Платформа КАК Платформа
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ИнформационнаяБаза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
//	Если Структура.Файловая Тогда
//		Структура.ИмяСервера = ИнформационнаяБаза.Адрес;
//		Структура.ИмяБазы = "";
//	КонецЕсли;
	
	Возврат Структура;
КонецФункции
